/*
 * *****************************************************************
 * *                                                               *
 * *    Copyright (c) Digital Equipment Corporation, 1991, 1999    *
 * *                                                               *
 * *   All Rights Reserved.  Unpublished rights  reserved  under   *
 * *   the copyright laws of the United States.                    *
 * *                                                               *
 * *   The software contained on this media  is  proprietary  to   *
 * *   and  embodies  the  confidential  technology  of  Digital   *
 * *   Equipment Corporation.  Possession, use,  duplication  or   *
 * *   dissemination of the software and media is authorized only  *
 * *   pursuant to a valid written license from Digital Equipment  *
 * *   Corporation.                                                *
 * *                                                               *
 * *   RESTRICTED RIGHTS LEGEND   Use, duplication, or disclosure  *
 * *   by the U.S. Government is subject to restrictions  as  set  *
 * *   forth in Subparagraph (c)(1)(ii)  of  DFARS  252.227-7013,  *
 * *   or  in  FAR 52.227-19, as applicable.                       *
 * *                                                               *
 * *****************************************************************
 */
/*
 * HISTORY
 */


#define	MIN_VOL		32		/* minimum number of volumes allowed */
#define	DEF_MAX_VOL	1024		/* soft maximum number of volumes allowed */
#define	MAX_VOL		4096		/* maximum number of volumes allowed */
#else /* !__alpha */
#define	MAX_VOL		256		/* maximum number of volumes allowed */
#define	MAX_PLEX	256		/* maximum number of plexes allowed */
#endif /* __alpha */
#define NAME_LEN	14		/* bytes in a name */
#define UTIL_LEN	14		/* chars in a utility defined field */
#define UTIL_NUM	3		/* number of utility defined fields */
#define COMMENT_LEN	40		/* chars in a comment field */
#define STATE_LEN	14		/* chars per utility state field */
#define FSTYPE_LEN	8		/* max length of fstype string */
#define PLEX_NUM	8		/* max number of plexes in a volume */
#ifdef	__alpha
#define SUBDISK_NUM	4096		/* max number of subdisks per plex */
#else /* !__alpha */
#define SUBDISK_NUM	256		/* max number of subdisks per plex */
#endif /* __alpha */
#define DK_PATH_LEN	32		/* chars in a disk /dev pathname */
#define SD_PATH_LEN	DK_PATH_LEN	/* chars in a subdisk /dev pathname */
#define V_STOPTS_LEN	32		/* chars of volume start options */
#define VOL_UUID_LEN	64		/* chars in a unique identifier */
#define DA_TYPE_LEN	14		/* disk device type len */
#define DA_INFO_LEN	128		/* disk device type-specific info len */
#define NAME_SZ		(NAME_LEN + 1)	/* bytes in a name field */
#define UTIL_SZ		(UTIL_LEN + 1)	/* bytes per utility defined field */
#define COMMENT_SZ	(COMMENT_LEN+1)	/* bytes in a comment field */
#define	FSTYPE_SZ	(FSTYPE_LEN+1)	/* size of fstype field */
#define STATE_SZ	(STATE_LEN + 1)	/* bytes per utility state field */
#define SD_PATH_SZ	(SD_PATH_LEN+1)	/* bytes per subdisk /dev pathname */
#define DK_PATH_SZ	(DK_PATH_LEN+1)	/* bytes per disk /dev pathname */
#define V_STOPTS_SZ	(V_STOPTS_LEN+1) /* bytes per volume start args */
#define VOL_UUID_SZ	(VOL_UUID_LEN+1) /* bytes in unique identifier */
#define DA_TYPE_SZ	(DA_TYPE_LEN+1)	/* bytes in disk device type */
#define DA_INFO_SZ	(DA_INFO_LEN+1)	/* bytes in disk device info */

#ifdef __alpha
typedef int voff_t;			/* device offsets and lengths */
typedef unsigned int uvoff_t;		/* unsigned version */
#else /* !__alpha */
typedef long voff_t;			/* device offsets and lengths */
typedef unsigned long uvoff_t;		/* unsigned version */
#endif /* __alpha */

/* the following two defines assume that voff_t is signed, twos-complement,
 * and that chars are eight bits */
#define VOFF_T_MAX	\
	((voff_t)(((voff_t)1 << (sizeof(voff_t) * 8 - 2)) + \
		  (((voff_t)1 << (sizeof(voff_t) * 8 - 2)) - (voff_t)1)))
#define VOFF_T_MIN	((voff_t)(-VOFF_T_MAX - (voff_t)1))

/*
 * VOFF_T_QUAD - is the voff_t type more than 32 bits
 *	Set VOFF_T_QUAD to 1 if voff_t is a 64 bit type
 */

#if !defined(VOFF_T_QUAD)
#define VOFF_T_QUAD	0
#endif

/* protocol version number of vold/kernel interface */
#define VOL_KERNEL_VERSION	4

#ifndef VOL_BIG_ENDIAN
#if defined(i386) || defined(vax)
#define VOL_BIG_ENDIAN	0
#else
#define VOL_BIG_ENDIAN	1
#endif
#endif

struct volseqno {
#if VOL_BIG_ENDIAN
	unsigned long seqno_hi;
	unsigned long seqno_lo;
#else
	unsigned long seqno_lo;
	unsigned long seqno_hi;
#endif
};
typedef struct volseqno volseqno_t;
typedef volseqno_t volrid_t;

#define VOLSEQNO_EQ(seq1, seq2)	\
	((seq1).seqno_lo == (seq2).seqno_lo &&		\
	 (seq1).seqno_hi == (seq2).seqno_hi)
#define VOLSEQNO_LT(seq1, seq2)	\
	((seq1).seqno_hi < (seq2).seqno_hi ||		\
	 ((seq1).seqno_hi == (seq2).seqno_hi && 	\
	  (seq1).seqno_lo < (seq2).seqno_lo))
#define VOLSEQNO_GT(seq1, seq2)	\
	((seq1).seqno_hi > (seq2).seqno_hi ||		\
	 ((seq1).seqno_hi == (seq2).seqno_hi && 	\
	  (seq1).seqno_lo > (seq2).seqno_lo))
#define VOLSEQNO_GE(seq1, seq2)	(! VOLSEQNO_LT((seq1), (seq2)))
#define VOLSEQNO_LE(seq1, seq2)	(! VOLSEQNO_GT((seq1), (seq2)))
#define VOLSEQNO_INC(seq)	\
	((seq).seqno_lo == 0xffffffff?			\
	 ((seq).seqno_lo = 0, (seq).seqno_hi++):	\
	 (seq).seqno_lo++)
#define VOLSEQNO_EQ_ZERO(seq)	((seq).seqno_hi == 0 && (seq).seqno_lo == 0)
#define VOLSEQNO_RESET(seq)	((seq).seqno_hi = 0, (seq).seqno_lo = 0)
#define VOLSEQNO_SET(seq, hi, lo)	\
	((seq).seqno_hi = (hi),		\
	 (seq).seqno_lo = (lo))
#define VOLSEQNO_HI(seq)	((seq).seqno_hi)
#define VOLSEQNO_LO(seq)	((seq).seqno_lo)

#define VOLRID_EQ(rid1, rid2)	(VOLSEQNO_EQ((rid1), (rid2)))
#define VOLRID_EQ_ZERO(rid)	(VOLSEQNO_EQ_ZERO((rid)))
#define VOLRID_RESET(rid)	(VOLSEQNO_RESET((rid)))
#define VOLRID_HASH(rid, mod)	((rid).seqno_lo % (ulong_t)(mod))
#define VOLRID_SET(rid, hi, lo)	(VOLSEQNO_SET((rid), (hi), (lo)))
#define VOLRID_HI(rid)		(VOLSEQNO_HI(rid))
#define VOLRID_LO(rid)		(VOLSEQNO_LO(rid))

/*
 * maximum alignment requirements for this machine
 *
 * VOL_ALIGN_SIZE	- size of largest C data type used in volume manager
 * VOL_ALIGN(p)		- return the pointer rounded up to an alignment boundary
 */

#define VOL_ALIGN_SIZE	(sizeof(union _vol_align))
union _vol_align {
	voff_t v;
	long l;
	ulong_t ul;
	int i;
#ifdef __alpha
	/*
	 * The reference to 'u' is mistaken for a u-area reference. If
	 * the 'u' field of this union is referenced, the reference needs
	 * to be changed.
	 */
	unsigned vol_align_u;
#else /* !__alpha */
	unsigned u;
#endif /* __alpha */
};
#define VOL_ALIGN(p)	\
	((VOID *)(((ulong_t)(p) + VOL_ALIGN_SIZE - 1) & ~(VOL_ALIGN_SIZE - 1)))

/* size in bytes of kernel information buffer available for use by vold */
#define VOLDINFO_SIZE		2048

/* encoding for high order bytes of volume manager ioctls */


#ifdef __alpha
/*
 * On alpha, _IO translate to no param list copy in and out.  This will cause the
 * callers arg pointer to be passed to the lower ioctl call.  vol* ioctl expects
 * this behavior.
 */
#include <sys/ioctl.h>
#define VOLIOC _IO(('V'), 0)
#else /* !__alpha */
#define VOLIOC  (('V' << 24) | ('O' << 16) | ('L' << 8))
#endif /* __alpha */

/* ioctl commands for any volume manager device */

#define	GET_DAEMON		(VOLIOC | 1)
#define	GET_VOLINFO		(VOLIOC | 2)

/* ioctls for /dev/rvol and /dev/plex devices */

#define	ATOMIC_COPY		(VOLIOC | 50)
#define	PLEX_READ		(VOLIOC | 51)
#define	PLEX_WRITE		(VOLIOC | 52)
#define	PLEX_DEV_READ		(VOLIOC | 53)
#define	PLEX_DEV_WRITE		(VOLIOC | 54)
#define	VERIFY_READ		(VOLIOC | 55)
#define	VERIFY_WRITE		(VOLIOC | 56)
#define VOL_LOG_WRITE		(VOLIOC | 58)
#define	PLEX_DETACH		(VOLIOC | 59)
#define VOL_READ		(VOLIOC | 60)
#define VOL_WRITE		(VOLIOC | 61)

/* ioctls for /dev/volevent device */

#define	VOL_TRACE_SET		(VOLIOC | 70)
#define	VOL_TRACE_GET		(VOLIOC | 71)
#define	VOL_EVENT_NUM		(VOLIOC | 72)
#define	VOL_GET_EVENT		(VOLIOC | 73)

/* ioctl for /dev/volinfo device */

#define VOL_GET_STATS		(VOLIOC | 75)
#define VOL_CLR_STATS		(VOLIOC | 76)
#define VOL_INDIRECT_IOCTL	(VOLIOC | 77)
#define VOL_GET_SDI_INFO	(VOLIOC | 78)

#if defined(TED_ACTIVE) || defined(__alpha)
#define VOL_SET_VOLINFO		(VOLIOC | 79)
#endif /* TED_ACTIVE || __alpha */

/* ioctls for /dev/voliod device */

#define	VOL_IO_DAEMON		(VOLIOC | 80)
#define VOL_IO_DAEMON_KILL	(VOLIOC | 81)
#define	VOL_IO_DAEMON_CNT	(VOLIOC | 82)
#define VOL_LOG_IO_DAEMON	(VOLIOC | 83)
#define	VOL_LOGIOD_WAIT		(VOLIOC | 84)
#define	VOL_LOGIOD_KILL		(VOLIOC | 85)
#define	VOL_LOGIOD_CHECK	(VOLIOC | 86)

/* ioctls for use by file systems */
#define VOL_FREEZE		(VOLIOC | 100)	/* stop file system activity */
#define VOL_THAW		(VOLIOC | 101)	/* restart file system */
/*
 * DEC ioctls.
 */
#define VOL_RDONLY_ROOT		(VOLIOC | 251)	/* Set root to read only */
						/* when booting from a plex */
#define VOL_ROOT_WRITTEN	(VOLIOC | 252)
#define VOL_UNSET_ROOT		(VOLIOC | 253)
#define VOL_SET_SWAP_PREF	(VOLIOC | 254)
#define VOL_UNSET_SWAP_PREF	(VOLIOC | 255)

/*
 * kernel information structure
 */

struct volinfo {
	long	version;		/* 0x00 kernel version number */
	long	voldinfo_sz;		/* 0x04 size of voldinfo area */
	major_t	volbmajor;		/* 0x08 volume blk dev major number */
	major_t	volcmajor;		/* 0x0c volume char dev major number */
	major_t	plexmajor;		/* 0x10 plex device major number */
	long	maxvol;			/* 0x14 max # of volumes supported */
	long	maxplex;		/* 0x18 max # of associated plexes */
	long	plexnum;		/* 0x1c max plexes per volume */
	long	sdnum;			/* 0x20 max subdisks per plex */
	long	max_ioctl;		/* 0x24 max size of ioctl data */
	long	max_specio;		/* 0x28 max size of ioctl I/O op */
	long	max_io;			/* 0x2c max size of I/O operation */
	long	max_ilocksleep;		/* 0x30 max sleeps on ilock */ 
	long	dflt_iodelay;		/* 0x34 default I/O delay for utils */
	long	max_freebuf;		/* 0x38 max number of volbufs to keep */
	long	max_freevcb;		/* 0x3c max number of volcbs to keep */
	long	max_parallelio;		/* 0x40 max # voldios allowed */
	long	volinfo_spare[15];	/* 0x44 unused - reserved for later */
};					/* 0x80 */

/*
 * configuration id numbers
 */
struct vol_id {
	long	config_id;		/* kept for source compatibility */
	time_t	config_epoch;		/* kept for source compatibility */
	volseqno_t config_tid;		/* last committed transaction ID */
};

/* values for state element of volconfig structure */
#define VOL_READY	    1	/* configuration ready to accept transaction */
#define VOL_COMMIT_START    2	/* commit has been started */
#define VOL_COMMIT_PHASE1   3	/* commit has reached phase 1 commit point */

/* values for resolution element of volconfig structure */
#define VOL_NONE	0	/* no transaction has been attempted */
#define START_ABORTED	1	/* tid was aborted out of COMMIT_START state */
#define START_TIMEOUT	2	/* tid was aborted due to datalock timeout in
				   the COMMIT_START state */
#define PHASE1_ABORTED	3	/* tid was aborted out of COMMIT_PHASE1 state */
#define PHASE1_TIMEOUT	4	/* tid was aborted due to datalock timeout in
				   the COMMIT_PHASE1 state, any volumes that
				   were data locked have been disabled and the
				   V_DLOCKTIMEOUT flag was set on them */
#define COMMITTED	5	/* tid was successfully committed */
#define INPROGRESS	6	/* tid is currently in progress */

/* values for flags element of volconfig structure */
#define	KERNEL_LOADED	0x01	/* set on a K_CONFIG_LOADED ioctl call */
#define	PENDING_CLEARED	0x02	/* set when the pending configuration records
				   have been cleared to match the active
				   records */

/*
 * configuration state
 */

struct volconfig {
	long	state;		/* 0x00 state of kernel transaction engine */
	long	tid;		/* 0x04 current or previous transaction id */
	long	resolution;	/* 0x08 status of transaction */
	long	flags;		/* 0x0c flags for configuration */
	long	verrno;		/* 0x10 status of last volconfig ioctl */
	struct vol_id  conf_id;	/* 0x14 config id for configuration */
	struct vol_id  cur_id;	/* 0x24 config id for transaction */
};				/* 0x34 */

/*
 * volume manager database summary
 */

struct vol_summary {
	size_t	vs_v_cnt;		/* number of volumes */
	size_t	vs_pl_cnt;		/* number of plexes */
	size_t	vs_sd_cnt;		/* number of subdisks */
	size_t	vs_pl_n_cnt;		/* number of non-associated plexes */
	size_t	vs_sd_n_cnt;		/* number of non-associated subdisks */
	size_t	vs_dm_cnt;		/* number of disk media records */
	size_t	vs_da_cnt;		/* number of disk access records */
	size_t	vs_host_cnt;		/* number of hosts */
	size_t	vs_info_cnt;		/* number of info records */
};

/*
 * structure used for volume device I/O ioctls
 */

struct plx_ent {
	char	pe_name[NAME_SZ];
	int	pe_errno;
};

struct vol_io {
	voff_t		vi_offset;	/* 0x00 offset on plex */
	size_t		vi_len;		/* 0x04 amount of data to read/write */
	caddr_t		vi_buf;		/* 0x08 ptr to buffer */
	size_t		vi_nsrcplex;	/* 0x0c number of source plexes */
	size_t		vi_ndestplex;	/* 0x10 number of destination plexes */
	struct plx_ent	*vi_plexptr;	/* 0x14 ptr to array of plex entries */
	ulong_t		vi_flag;	/* 0x18 flags associated with op */
};					/* 0x1c */

/* flags stored in vol_io.vi_flag */
#define	VI_LOGIO	0x00000001	/* perform operation to log area */

struct vol_rdwr {
	ulong_t		vrw_flags;	/* flags */
	voff_t		vrw_off;	/* offset in volume (sectors) */
	size_t		vrw_size;	/* number of sectors to Xfer */
	caddr_t		vrw_addr;	/* user address for Xfer */
};

#define	VRW_ASNC	0x1		/* Do writes asynchronously */
#define VRW_RWBACK	0x2		/* read-writeback read loop I/O */

/*
 * Structure used to request an ioctl to another device.  Utilities
 * can use this to ioctl devices that don't have device nodes, or where
 * the device nodes can't be trusted to be correct.
 */
struct vol_indirect_ioctl {
	dev_t			vioc_dev;	/* 0x00 raw device number */
	int			vioc_cmd; 	/* 0x04 ioctl to issue */
	caddr_t			vioc_arg; 	/* 0x08 ioctl argument */
};						/* 0x0c */

/*
 * structure used by vold to get information about the sdi device
 * driver.  This structure may be specific to the i386 releases of
 * SVR4.0 and SVR4.2.
 */
#define VOL_SD01_MAX		16
struct vol_sdi_info {
	size_t	sdi_ndiskpermajor;		/* # of disks per major */
	size_t	sdi_npart;			/* # of partitions per disk */
	size_t	sdi_nmajor;			/* # of major devices */
	major_t	*sdi_cmajors;			/* char majors for sd01 */
	major_t	*sdi_bmajors;			/* block majors for sd01 */
};

/*
 * volume - one or more replicated plex data sets
 */

/* volume enums */
enum vol_r_pol {			/* type of volume read policy */
	MIN_VOL_R_POL,			/* sentinel value, must be first */
	V_ROUND,			/* round robin */
	V_PREFER,			/* use a preferred plex */
	V_R_POL_SELECT,			/* select based on plex layouts */
	MAX_VOL_R_POL			/* sentinel value, must be last */
};
enum vol_kstate {			/* volume kernel state */
